Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel
The OkApplyModifyGetOnOffCancel class represents a control including the Ok-Apply-Modify-Get-On/Off-Cancel button group.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.#ctor
Initializes a new instance of the OkApplyModifyGetOnOffCancel class.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.OnLoad(System.EventArgs)
Localizes the control when loaded.
Exc: The event arguments.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.OkClicked
The OkClicked event is raised when the Ok button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.ApplyClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.ModifyClicked
The ModifyClicked event is raised when the Modify button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.GetClicked
The GetClicked event is raised when the Get button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.OnOffClicked
The OnOffClicked event is raised when the On-Off button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.OkApplyModifyGetOnOffCancel.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.